Revit 2026 API

# EnergyAnalysisSurfaceSurfaceType Property

---

The analytical surface type.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public EnergyAnalysisSurfaceType SurfaceType { get; }
```
```vb
Public ReadOnly Property SurfaceType As EnergyAnalysisSurfaceType
	Get
```
```cpp
public:
property EnergyAnalysisSurfaceType SurfaceType {
	EnergyAnalysisSurfaceType get ();
}
```
```fsharp
member SurfaceType : EnergyAnalysisSurfaceType with get
```

#### Property Value

EnergyAnalysisSurfaceType

#### Reference

EnergyAnalysisSurface Class

Autodesk.Revit.DB.Analysis Namespace